{"pageContext":{"id":"8b88afe7-2e8e-5cec-8fdc-9ca0d276c119","title":"Portfolio 2","slug":"portfolio-2","excerpt":"<p>If you have a passion for travel, food, gadgets, or simply enjoy ranting, you may already have discovered the benefits of blogging. Recording your forays into food or experimentation with radical comm</p>\n","content":"\n<p>If you have a passion for travel, food, gadgets, or simply enjoy ranting, you may already have discovered the benefits of blogging. Recording your forays into food or experimentation with radical communists allows you to share your news and views with the internet community.</p>\n\n\n\n<p>WordPress has thousands of templates to help you get started. In this guide, you’ll explore five of the very best themes specifically for hobbyists and bloggers. Some of these such as ‘Writing’ also incorporate SEO features meaning people searching online will be more likely to stumble across your blog.</p>\n\n\n\n<p>If you’re starting on a shoe-string budget, consider using one of the free themes we’ve listed here, such as Morning Time Lite.1. TheBlogger</p>\n\n\n\n<p>TheBlogger has multiple widgets for forms, emailing and more</p>\n\n\n\n<p>PROS:</p>\n\n\n\n<p>+ Helpful documentation</p>\n\n\n\n<p>+ Retina-ready</p>\n\n\n\n<p>+ Newsletter feature</p>\n\n\n\n<p>TheBlogger is a WordPress theme suitable for storytelling and writing. It comes with a responsive design and multiple gallery features. TheBlogger also comes with a live customizer which helps you to tweak every part of your theme.</p>\n\n\n\n<p>It is Retina-ready and can be optimized for tablets and smartphones. Users can try the theme before buying. They can test drive the customizer to see if it meets their needs.</p>\n\n\n\n<p>There are a wide variety of widgets and sliders available to showcase your posts in image or video format.</p>\n\n\n\n<p>TheBlogger comes with helpful documentation that is straightforward and easy to follow. MailChimp for WordPress is also included. This allows you to send out newletters to blog subscribers.</p>\n\n\n\n<p>The theme integrates with Ninja Forms. Users can easily create and add forms with the drag and drop feature.</p>\n\n\n\n<p>A regular licence costs $59 (£44.58) which includes future updates and 6-months support. Users can upgrade to 12-months support for a further $17.63 (£13.32).2. Foodie Pro</p>\n\n\n\n<p>Food lovers will enjoy the mouth-watering layout of this pro blog for a price</p>\n","featured_media":{"source_url":"https://www.rangsitpost.com/wp-content/uploads/2019/05/charles-456501-unsplash.jpg"},"acf":{"portfolio_url":"https://www..google.com/"}}}