{"pageContext":{"id":"c0609e2c-9b52-5d5e-a0bb-582f305670bc","title":"Portfolio 3","slug":"portfolio-3","excerpt":"<p>Wayla isn’t the easiest restaurant to find. This Thai restaurant which opened in late April is subterranean, tucked away beneath nondescript, mostly shuttered buildings on Forsyth Street on New York’s Lower East Side. There’s no real sign to announce it; just the street number and stairs leading down to what seems to be a bar. But that plays into its purpose. Enter here and you’re intentionally b</p>\n","content":"\n<p>Wayla isn’t the easiest restaurant to find. This Thai restaurant which opened in late April is subterranean, tucked away beneath nondescript, mostly shuttered buildings on Forsyth Street on New York’s Lower East Side. There’s no real sign to announce it; just the street number and stairs leading down to what seems to be a bar. But that plays into its purpose. Enter here and you’re intentionally blocked from the hubbub in the city and into a cocoon where co-owners Erika Chou and chef Tom Naumsuwan want to transport you to another place, or time, the translation of the restaurant’s name. Given the setting, the quality of the cocktails and of the food, including Thai preparations rarely seen and superlative versions of others more familiar, the two succeed in that. &nbsp;(For those who aren’t interested in being cocooned, there’s also a patio in the back past the dining room’s long dark passageway that is destined to be a popular outdoor dining spot this summer.)</p>\n\n\n\n<p>Crispy pork meatballs previously served only for the king.Diana Yen</p>\n\n\n\n<p>Naumsuwan’s background is in the extensive street food scene in Bangkok where he grew up and his specialty is homestyle/market driven dishes. That’s in evidence in the Nam Prik platter, an array of raw vegetables with three dipping sauces featuring ingredients such as ground pork with tomato and chili paste and crushed shrimp with lemongrass, coconut milk and bean chili paste. It goes well with cocktails like the Sway Wayla, composed of Brooklyn gin, butterfly pea blossom, cucumber, lemon and shiso, one of the creations of Anthony Baker formerly of The Aviary. &nbsp;Another dish, Moo Sarong, seems to be homestyle but actually has a regal history: these pork meatballs wrapped in thin crispy noodles and flavored with white pepper and sambal chili are usually prepared solely for the king.&nbsp; They&#8217;re succulent, flavorful and shouldn&#8217;t be missed.</p>\n","featured_media":{"source_url":"https://www.rangsitpost.com/wp-content/uploads/2019/05/igor-miske-207639-unsplash.jpg"},"acf":{"portfolio_url":"https://www.udemy.com/"}}}